Repository: HomyakovaAlena/angular-project-management-app
Catalog: src/locale/messages.*.xlf
Languages: ru

source: Edit profile
ru: Редактировать профиль

source: Username:
ru: Имя пользователя:

source: Login:
ru: Логин:

source: login
ru: логин

source: Password:
ru: Пароль:

source: password
ru: пароль

source: Confirm password:
ru: Подтвердите пароль:

source: confirm password
ru: подтвердите пароль

source: Update
ru: Обновить

source: Are you sure you want to delete your user?
ru: Вы уверены, что хотите удалить своего пользователя?

source: If you confirm, the user name will be deleted.
ru: Если вы подтвердите, пользователь name будет удален.

source: Delete
ru: Удалить

source: Login
ru: Авторизоваться

source: Login
ru: Авторизоваться

source: Login
ru: Логин

source: Logout
ru: Выйти

source: Sign Up
ru: Зарегистрироваться

source: SignUp
ru: Зарегистрироваться

source: Sign Up
ru: Зарегистрироваться

source: Welcome, user.name!
ru: Добро пожаловать, user.name!

source: Successfully updated!
ru: Успешно обновлено!

source: Come back!
ru: Возвращайтесь!

source: Users:
ru: Пользователи:

source: Boards List
ru: Список досок

source: You have no boards yet
ru: У вас пока нет ни одной доски

source: Creating board...
ru: Создание доски...

source: Fill in the form to create new board.
ru: Заполните форму, чтобы создать новую доску.

source: Create new board
ru: Создать новую доску

source: Board Title
ru: Название доски

source: Are you sure you want to delete this item?
ru: Вы уверены, что хотите удалить этот элемент?

source: If you confirm, the item title will be deleted.
ru: Если вы подтвердите, элемент title будет удален.

source: Success!
ru: Успех!

source: Looks like you are lost...
ru: Похоже, ты заблудился...

source: To main page
ru: На главную страницу

source: To boards page
ru: На страницу досок

source: Everything you do should be done well, even if you commit madness.
ru: Все, что делаешь, надо делать хорошо, даже если совершаешь безумство.

source: Honore de Balzac
ru: Оноре де Бальзак

source: Do it well<br /> with our Kanban board!
ru: Сделайте задуманное хорошо<br /> с помощью нашей канбан-доски!

source: Just simple <br /> Kanban Board
ru: Простая <br /> канбан-доска

source: Why to use<br />Kanban board?
ru: Зачем нужна<br />канбан-доска?

source: Ask our competitors...
ru: Спросите наших конкурентов...

source: ...and return <br />to our simple board!
ru: ...и возвращайтесь <br />к нам!

source: Created with
ru: Создано с

source: and
ru: и

source: during the
ru: в рамках

source: UpSkillMe course
ru: курса UpSkillMe

source: Begin type to search task...
ru: Начните печатать для поиска задачи...

source: Editing task...
ru: Редактирование задачи...

source: Fill in the form to edit task.
ru: Заполните форму для редактирования задачи.

source: Edit
ru: Редактировать

source: Something wrong with your request. Please try again later
ru: Что-то не так с вашим запросом. Пожалуйста, попробуйте позже

source: Incorrect login/password combination. Please try again
ru: Неверная комбинация логин/пароль. Пожалуйста, попробуйте еще раз

source: Login already exist
ru: Логин уже существует

source: Board(s) not found
ru: Доска(и) не найдена(ы)

source: Whoops, looks like something went wrong. Please try again later
ru: Упс, похоже, что-то пошло не так. Пожалуйста, попробуйте позже

source: Column(s) not found
ru: Столбцы не найдены

source: Task(s) not found
ru: Задача(и) не найдена(ы)

source: User(s) not found
ru: Пользователи не найдены

source: Username is required
ru: Требуется Имя пользователя

source: Username must be at least 2 symbols
ru: Имя пользователя должно быть не менее 2 символов

source: Username is too long. Please, use no more than 20 symbols
ru: Имя пользователя слишком длинное. Пожалуйста, используйте не более 20 символов

source: Please, use letters or numbers, or symbols '-_.' for your username. The first character must be a letter
ru: Пожалуйста, используйте буквы или цифры, или символы '-_'. для вашего имени пользователя. Первый символ должен быть буквой

source: Login is required
ru: Требуется логин

source: Login must be at least 2 symbols
ru: Логин должен быть не менее 2-х символов

source: Login is too long. Please, use no more than 20 symbols
ru: Логин слишком длинный. Пожалуйста, используйте не более 20 символов

source: Please, use letters or numbers, or symbols '-_.' for your login. The first character must be a letter
ru: Пожалуйста, используйте буквы или цифры, или символы '-_'. для входа. Первый символ должен быть буквой

source: Password is required
ru: требуется пароль

source: Password must be at least 8 symbols
ru: Пароль должен быть не менее 8 символов

source: Password is too long. Please, use no more than 20 symbols
ru: Пароль слишком длинный. Пожалуйста, используйте не более 20 символов

source: Password must include: - at least one upper case Latin letter, - at least one lower case Latin letter, - at least one digit, - at least one special character ?=.*[#?!@$%^&*-]
ru: Пароль должен включать: - хотя бы одна заглавная латинская буква, - хотя бы одна строчная латинская буква, - хотя бы одна цифра, - хотя бы один специальный символ ?=.*[#?!@$%^&*-]

source: Please, confirm password
ru: Пожалуйста, подтвердите пароль

source: Password and Confirm password fields must match
ru: Поля «Пароль» и «Подтверждение пароля» должны совпадать

source: Title is required
ru: Требуется Название

source: Title must be at least 2 symbols
ru: Название должно содержать не менее 2 символов

source: Title is too long. Please, use no more than 20 symbols
ru: Название слишком длинное. Пожалуйста, используйте не более 20 символов

source: Description is required
ru: Требуется описание

source: Description must be at least 2 symbols
ru: Описание должно быть не менее 2 символов

source: Description is too long. Please, use no more than 50 symbols
ru: Описание слишком длинное. Пожалуйста, используйте не более 50 символов

source: If you confirm, the item title will be deleted.
ru: Если вы подтвердите, элемент title будет удален.

source: Creating column...
ru: Создание столбца...

source: Fill in the form to create new column
ru: Заполните форму, чтобы создать новую колонку

source: Create new column
ru: Создать новый столбец

source: Column Title
ru: Название столбца

source: Column #1
ru: Колонка №1

source: Creating task...
ru: Создание задачи...

source: Fill in the form to create new task
ru: Заполните форму, чтобы создать новую задачу

source: Create new task
ru: Создать новую задачу

source: Task Title
ru: Название задачи

source: Task Description
ru: Описание задачи

source: description
ru: описание

source: Task #1
ru: Задача 1

source: Description #1
ru: Описание №1

source: found x.length task(s) matching "term"
ru: задач, соответствующих "term", найдено x.length

source: no tasks matching "term"
ru: нет задач, соответствующих "term"

source: User user.name has already been selected
ru: Пользователь user.name уже выбран

source: Back to Boards
ru: Назад к доскам

source: Create Board
ru: Создать Доску

source: Board Owner:
ru: Владелец Доски:

source: Boards
ru: Доски

source: Create boards
ru: Создавать доски

source: Rearrange tasks / columns
ru: Перемещать задачи / столбцы

source: Search tasks
ru: Искать задачи

source: Select users
ru: Выбирать пользователей

source: Task Owner:
ru: Владелец задачи:

source: name
ru: имя

source: Owner:
ru: Владелец:

source: title
ru: название

source: users
ru: пользователи

source: Cancel
ru: Отмена

source: errorMessageType[errorResponse.status as keyof typeof errorMessageType]. Error errorResponse.status
ru: errorMessageType[errorResponse.status as keyof typeof errorMessageType]. Ошибка errorResponse.status

source: Create Column
ru: Создать столбец

source: Create Task
ru: Создать Задачу

source: Begin type to search user...
ru: Начните печатать, чтобы искать пользователя...

source: found x.length user(s) matching "term"
ru: найдено x.length пользователя(ей), соответствующих "term"

source: no users matching "term"
ru: пользователей, соответствующих "term", не найдено

source: edit board
ru: редактировать доску

source: delete board
ru: удалить доску

source: Github Logo
ru: Логотип ГитХаба

source: Course Logo
ru: Логотип курса

source: Page not found
ru: Страница не найдена

source: heart
ru: сердце

source: angular Logo
ru: логотип Ангуляра

source: Typescript_logo Logo
ru: Логотип Тайпскрипта

source: save changes
ru: сохранить изменения

source: delete column
ru: удалить колонку

source: Task {{ task.title }} Description {{ task.description }}
ru: Задача {{ task.title }} Описание {{ task.description }}

source: delete task
ru: удалить задачу

source: Task owner {{ task.userId | usernameById | async }}
ru: Владелец задачи {{ task.userId | usernameById | async }}

source: Responsible: {{ user | usernameById | async }}
ru: Ответственные: {{ user | usernameById | async }}

source: epam logo
ru: логотип epam

source: Cancel
ru: Отмена

source: ngrx Logo
ru: логотип ngrx

source: rxjs Logo
ru: логотип rxjs

source: scss Logo
ru: логотип scss

source: material Logo
ru: логотип Материал
